# 1. Написать цикл для выведения на экран каждой буквы своего ФИО.

FIO = input('введите свое ФИО через пробел: ')
for el in FIO:
    print(el)
