# 3. Создайте собственный класс-исключение, который должен проверять содержимое списка на наличие только чисел.
# Проверить работу исключения на реальном примере. Запрашивать у пользователя данные и заполнять список необходимо
# только числами. Класс-исключение должен контролировать типы данных элементов списка.
# Примечание: длина списка не фиксирована. Элементы запрашиваются бесконечно, пока пользователь сам не остановит
# работу скрипта, введя, например, команду «stop». При этом скрипт завершается, сформированный список с числами выводится на экран.
# Подсказка: для этого задания примем, что пользователь может вводить только числа и строки. Во время ввода
# пользователем очередного элемента необходимо реализовать проверку типа элемента. Вносить его в список, только если
# введено число. Класс-исключение должен не позволить пользователю ввести текст (не число) и отобразить соответствующее
# сообщение. При этом работа скрипта не должна завершаться.

class MyOwn(Exception):
    def __init__(self, par):
        self.par = par


res_list = []

while True:
    try:
        elem = input("Введите число или exit для завершения: ")
        if elem == 'exit':
            break
        elif elem.isdigit():
            res_list.append(int(elem))
        else:
            raise MyOwn("Неправильный ввод, прочтите условие выше")
    except MyOwn as w:
        print(w.par)

print(res_list)
